In [1]:
# Importamos las librerías que necesitamos

# Tratamiento de datos
import pandas as pd
import numpy as np

# Visualización
import matplotlib.pyplot as plt
import seaborn as sns

# Ocultamos las advertencias para evitar mensajes innecesarios
import warnings
warnings.filterwarnings("ignore")

# Configuración
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

In [2]:
# Lo primero que hacemos es cargar el dataframe que vamos a usar
df = pd.read_csv("spaces_hr_raw_data.csv")
df.head()

,Unnamed: 0,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,0,51,No,NaN,2015.722222,NaN,6,3,NaN,1,1,1,0,NaN,3,5,resEArch DIREcToR,3,NaN,"16280,83$","42330,17$",7,Y,No,13,"3,0",3,Full Time,0,NaN,5,"3,0",20,NaN,15,15,"16280,83$",1972,"195370,00$",NaN,NaN,Yes
1,1,52,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,3,0,NaN,2,5,ManAGeR,3,NaN,NaN,"43331,17$",0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,NaN,1971,"199990,00$",NaN,NaN,1
2,2,42,No,travel_rarely,1984.253968,Research & Development,4,2,Technical Degree,1,3,3,0,NaN,3,5,ManaGER,4,Married,NaN,"41669,33$",1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,NaN,1981,"192320,00$",ManaGER - Research & Development,NaN,1
3,3,47,No,travel_rarely,1771.404762,NaN,2,4,Medical,1,4,1,1,NaN,3,4,ReseArCH DIrECtOr,3,Married,"14307,50$","37199,50$",3,Y,NaN,19,"3,0",2,Full Time,2,NaN,2,NaN,20,NaN,5,6,"14307,50$",1976,"171690,00$",NaN,NaN,False
4,4,46,No,NaN,1582.771346,NaN,3,3,Technical Degree,1,5,1,1,NaN,4,4,sAleS EXECUtIve,1,Divorced,"12783,92$","33238,20$",2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,"12783,92$",1977,NaN,NaN,NaN,0

In [3]:
df.columns

Index(['Unnamed: 0', 'age', 'attrition', 'businesstravel', 'dailyrate',
       'department', 'distancefromhome', 'education', 'educationfield',
       'employeecount', 'employeenumber', 'environmentsatisfaction', 'gender',
       'hourlyrate', 'jobinvolvement', 'joblevel', 'jobrole',
       'jobsatisfaction', 'maritalstatus', 'monthlyincome', 'monthlyrate',
       'numcompaniesworked', 'over18', 'overtime', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'standardhours',
       'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear',
       'worklifebalance', 'yearsatcompany', 'yearsincurrentrole',
       'yearssincelastpromotion', 'yearswithcurrmanager',
       'sameasmonthlyincome', 'datebirth', 'salary', 'roledepartament',
       'numberchildren', 'remotework'],
      dtype='object')

In [4]:
df = df.drop(columns=['numberchildren', 'over18', 'yearsincurrentrole'])

In [5]:
df.columns

Index(['Unnamed: 0', 'age', 'attrition', 'businesstravel', 'dailyrate',
       'department', 'distancefromhome', 'education', 'educationfield',
       'employeecount', 'employeenumber', 'environmentsatisfaction', 'gender',
       'hourlyrate', 'jobinvolvement', 'joblevel', 'jobrole',
       'jobsatisfaction', 'maritalstatus', 'monthlyincome', 'monthlyrate',
       'numcompaniesworked', 'overtime', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'standardhours',
       'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear',
       'worklifebalance', 'yearsatcompany', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'remotework'],
      dtype='object')

In [6]:
def exploracion_basica(df):
    print("=== EXPLORACIÓN BÁSICA DEL DATASET ===")
    print("\nPrimeras filas:")
    print(df.head())
    print("\nÚltimas filas:")
    print(df.tail())
    print("\nNúmero de filas y columnas:")
    print(df.shape)
    print("\nInformación general del DataFrame:")
    print(df.info())
    print("\nEstadísticas descriptivas:")
    print(df.describe())
    print("\nColumnas:")
    print(list(df.columns))

In [7]:
exploracion_basica(df)

=== EXPLORACIÓN BÁSICA DEL DATASET ===

Primeras filas:
   Unnamed: 0 age attrition businesstravel    dailyrate  \
0           0  51        No            NaN  2015.722222
1           1  52        No            NaN  2063.388889
2           2  42        No  travel_rarely  1984.253968
3           3  47        No  travel_rarely  1771.404762
4           4  46        No            NaN  1582.771346

                 department  distancefromhome  education    educationfield  \
0                       NaN                 6          3               NaN
1                       NaN                 1          4     Life Sciences
2   Research & Development                  4          2  Technical Degree
3                       NaN                 2          4           Medical
4                       NaN                 3          3  Technical Degree

   employeecount  employeenumber  environmentsatisfaction  gender  hourlyrate  \
0              1               1                        1       0         NaN
1              1               2                        3       0         NaN
2              1               3                        3       0         NaN
3              1               4                        1       1         NaN
4              1               5                        1       1         NaN

   jobinvolvement  joblevel              jobrole  jobsatisfaction  \
0               3         5   resEArch DIREcToR                 3
1               2         5             ManAGeR                 3
2               3         5             ManaGER                 4
3               3         4   ReseArCH DIrECtOr                 3
4               4         4     sAleS EXECUtIve                 1

  maritalstatus monthlyincome monthlyrate  numcompaniesworked overtime  \
0           NaN     16280,83$   42330,17$                   7       No
1           NaN           NaN   43331,17$                   0      NaN
2       Married           NaN   41669,33$                   1       No
3       Married     14307,50$   37199,50$                   3      NaN
4      Divorced     12783,92$   33238,20$                   2       No

   percentsalaryhike performancerating  relationshipsatisfaction  \
0                 13               3,0                         3
1                 14               3,0                         1
2                 11               3,0                         4
3                 19               3,0                         2
4                 12               3,0                         4

  standardhours  stockoptionlevel totalworkingyears  trainingtimeslastyear  \
0     Full Time                 0               NaN                      5
1           NaN                 1              34,0                      5
2           NaN                 0              22,0                      3
3     Full Time                 2               NaN                      2
4           NaN                 1               NaN                      5

  worklifebalance  yearsatcompany  yearssincelastpromotion  \
0             3,0              20                       15
1             3,0              33                       11
2             NaN              22                       11
3             NaN              20                        5
4             3,0              19                        2

   yearswithcurrmanager sameasmonthlyincome  datebirth      salary  \
0                    15           16280,83$       1972  195370,00$
1                     9                 NaN       1971  199990,00$
2                    15                 NaN       1981  192320,00$
3                     6           14307,50$       1976  171690,00$
4                     8           12783,92$       1977         NaN

                        roledepartament remotework
0                                   NaN        Yes
1                                   NaN          1
2   ManaGER  -  Research & Development           1
3                                   NaN      False
4                                   NaN          0

Últimas filas:
      Unnamed: 0 age attrition businesstravel    dailyrate department  \
1673        1673  43        No            NaN   488.944444        NaN
1674        1674  47        No            NaN  1973.984127        NaN
1675        1675  29        No  travel_rarely   290.035510        NaN
1676        1676  47        No  travel_rarely  1032.487286        NaN
1677        1677  32        No            NaN   556.256661        NaN

      distancefromhome  education educationfield  employeecount  \
1673               -26          3        Medical              1
1674                26          4            NaN              1
1675                15          3            NaN              1
1676                 4          3  Life Sciences              1
1677                 2          2  Life Sciences              1

      employeenumber  environmentsatisfaction  gender  hourlyrate  \
1673             824                        2       1         NaN
1674            1087                        4       1         NaN
1675             528                        3       0         NaN
1676              76                        3       1         NaN
1677             401                        4       1   69.532083

      jobinvolvement  joblevel                   jobrole  jobsatisfaction  \
1673               4         1       rESEaRcH SciEnTiST                 3
1674               3         5                  mANager                 3
1675               3         1       reSearch sCienTiSt                 4
1676               2         3   maNufACTURING DIREctOr                 2
1677               3         2       resEArch scIENTisT                 3

     maritalstatus monthlyincome monthlyrate  numcompaniesworked overtime  \
1673        Single      3949,17$   10267,83$                   4      NaN
1674       Married     15943,72$   41453,67$                   3       No
1675           NaN           NaN    6090,75$                   1       No
1676      Divorced      8339,32$   21682,23$                   8      Yes
1677        Single           NaN   11681,39$                   4      Yes

      percentsalaryhike performancerating  relationshipsatisfaction  \
1673                 12               3,0                         4
1674                 11               3,0                         3
1675                 19               3,0                         1
1676                 12               NaN                         3
1677                 14               3,0                         4

     standardhours  stockoptionlevel totalworkingyears  trainingtimeslastyear  \
1673           NaN                 0               NaN                      2
1674     Full Time                 1              27,0                      2
1675     Part Time                 0               6,0                      1
1676     Part Time                 1               NaN                      4
1677     Part Time                 0              10,0                      2

     worklifebalance  yearsatcompany  yearssincelastpromotion  \
1673             3,0               3                        1
1674             3,0               5                        1
1675             3,0               6                        1
1676             3,0              22                       14
1677             3,0               8                        0

      yearswithcurrmanager sameasmonthlyincome  datebirth      salary  \
1673                     2            3949,17$       1980         NaN
1674                     0           15943,72$       1976  191324,62$
1675                     5                 NaN       1994   28111,13$
1676                    10            8339,32$       1976  100071,84$
1677                     7                 NaN       1991   53914,11$

     roledepartament remotework
1673             NaN        Yes
1674             NaN      False
1675             NaN      False
1676             NaN        Yes
1677             NaN          0

Número de filas y columnas:
(1678, 39)

Información general del DataFrame:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1678 entries, 0 to 1677
Data columns (total 39 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Unnamed: 0                1678 non-null   int64
 1   age                       1678 non-null   object
 2   attrition                 1678 non-null   object
 3   businesstravel            877 non-null    object
 4   dailyrate                 1678 non-null   float64
 5   department                312 non-null    object
 6   distancefromhome          1678 non-null   int64
 7   education                 1678 non-null   int64
 8   educationfield            904 non-null    object
 9   employeecount             1678 non-null   int64
 10  employeenumber            1678 non-null   int64
 11  environmentsatisfaction   1678 non-null   int64
 12  gender                    1678 non-null   int64
 13  hourlyrate                411 non-null    float64
 14  jobinvolvement            1678 non-null   int64
 15  joblevel                  1678 non-null   int64
 16  jobrole                   1678 non-null   object
 17  jobsatisfaction           1678 non-null   int64
 18  maritalstatus             1003 non-null   object
 19  monthlyincome             1189 non-null   object
 20  monthlyrate               1678 non-null   object
 21  numcompaniesworked        1678 non-null   int64
 22  overtime                  982 non-null    object
 23  percentsalaryhike         1678 non-null   int64
 24  performancerating         1478 non-null   object
 25  relationshipsatisfaction  1678 non-null   int64
 26  standardhours             1327 non-null   object
 27  stockoptionlevel          1678 non-null   int64
 28  totalworkingyears         1129 non-null   object
 29  trainingtimeslastyear     1678 non-null   int64
 30  worklifebalance           1564 non-null   object
 31  yearsatcompany            1678 non-null   int64
 32  yearssincelastpromotion   1678 non-null   int64
 33  yearswithcurrmanager      1678 non-null   int64
 34  sameasmonthlyincome       1189 non-null   object
 35  datebirth                 1678 non-null   int64
 36  salary                    1393 non-null   object
 37  roledepartament           312 non-null    object
 38  remotework                1678 non-null   object
dtypes: float64(2), int64(19), object(18)
memory usage: 511.4+ KB
None

Estadísticas descriptivas:
        Unnamed: 0    dailyrate  distancefromhome    education  employeecount  \
count  1678.000000  1678.000000       1678.000000  1678.000000         1678.0
mean    838.500000   668.079714          4.504172     2.932658            1.0
std     484.541192   470.787298         14.652066     1.024270            0.0
min       0.000000   104.103175        -49.000000     1.000000            1.0
25%     419.250000   290.035510          2.000000     2.000000            1.0
50%     838.500000   556.256661          5.000000     3.000000            1.0
75%    1257.750000   971.956349         11.000000     4.000000            1.0
max    1677.000000  2063.388889         29.000000     5.000000            1.0

       employeenumber  environmentsatisfaction       gender  hourlyrate  \
count     1678.000000              1678.000000  1678.000000  411.000000
mean       809.859952                 4.264005     0.398689   83.140768
std        467.084867                 6.912695     0.489774   57.272101
min          1.000000                 1.000000     0.000000   13.012897
25%        403.250000                 2.000000     0.000000   36.254439
50%        813.500000                 3.000000     0.000000   69.532083
75%       1215.750000                 4.000000     1.000000  116.987103
max       1614.000000                49.000000     1.000000  255.963294

       jobinvolvement     joblevel  jobsatisfaction  numcompaniesworked  \
count     1678.000000  1678.000000      1678.000000         1678.000000
mean         2.740763     2.064362         2.743147            2.670441
std          0.710359     1.099425         1.105172            2.501133
min          1.000000     1.000000         1.000000            0.000000
25%          2.000000     1.000000         2.000000            1.000000
50%          3.000000     2.000000         3.000000            2.000000
75%          3.000000     3.000000         4.000000            4.000000
max          4.000000     5.000000         4.000000            9.000000

       percentsalaryhike  relationshipsatisfaction  stockoptionlevel  \
count        1678.000000               1678.000000       1678.000000
mean           15.154350                  2.700238          0.787843
std             3.649607                  1.079494          0.843252
min            11.000000                  1.000000          0.000000
25%            12.000000                  2.000000          0.000000
50%            14.000000                  3.000000          1.000000
75%            18.000000                  4.000000          1.000000
max            25.000000                  4.000000          3.000000

       trainingtimeslastyear  yearsatcompany  yearssincelastpromotion  \
count            1678.000000     1678.000000              1678.000000
mean                2.795590        7.124553                 2.241955
std                 1.288657        6.173837                 3.246554
min                 0.000000        0.000000                 0.000000
25%                 2.000000        3.000000                 0.000000
50%                 3.000000        5.000000                 1.000000
75%                 3.000000        9.000000                 3.000000
max                 6.000000       40.000000                15.000000

       yearswithcurrmanager    datebirth
count           1678.000000  1678.000000
mean               4.200238  1986.047080
std                3.554224     9.154908
min                0.000000  1963.000000
25%                2.000000  1980.000000
50%                3.000000  1987.000000
75%                7.000000  1993.000000
max               17.000000  2005.000000

Columnas:
['Unnamed: 0', 'age', 'attrition', 'businesstravel', 'dailyrate', 'department', 'distancefromhome', 'education', 'educationfield', 'employeecount', 'employeenumber', 'environmentsatisfaction', 'gender', 'hourlyrate', 'jobinvolvement', 'joblevel', 'jobrole', 'jobsatisfaction', 'maritalstatus', 'monthlyincome', 'monthlyrate', 'numcompaniesworked', 'overtime', 'percentsalaryhike', 'performancerating', 'relationshipsatisfaction', 'standardhours', 'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear', 'worklifebalance', 'yearsatcompany', 'yearssincelastpromotion', 'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary', 'roledepartament', 'remotework']

In [8]:
# Variables con valores nulos
def nulls(df,count=0,share=0):
    
    nulls = df.isnull().sum()
    nulls_share = df.isnull().sum()/df.shape[0]*100
    with_nulls_share = nulls_share[nulls_share > 0]
    
    if count == 1:
        print('Count of nulls')
        with_nulls = nulls[nulls > 0]
        print (with_nulls.sort_values(ascending=False))
        print('-----------------------------------')
    
    if share == 1:
        print('share of nulls')
        print (with_nulls_share.sort_values(ascending=False))
    
    nulls_list = with_nulls_share.to_frame(name='perc_nulos').reset_index().rename(columns={'index': 'var'})
    
    return nulls_list

In [9]:
nulls(df,1,1)

Count of nulls
department             1366
roledepartament        1366
hourlyrate             1267
businesstravel          801
educationfield          774
overtime                696
maritalstatus           675
totalworkingyears       549
monthlyincome           489
sameasmonthlyincome     489
standardhours           351
salary                  285
performancerating       200
worklifebalance         114
dtype: int64
-----------------------------------
share of nulls
department             81.406436
roledepartament        81.406436
hourlyrate             75.506555
businesstravel         47.735399
educationfield         46.126341
overtime               41.477950
maritalstatus          40.226460
totalworkingyears      32.717521
monthlyincome          29.141836
sameasmonthlyincome    29.141836
standardhours          20.917759
salary                 16.984505
performancerating      11.918951
worklifebalance         6.793802
dtype: float64

                    var  perc_nulos
0        businesstravel   47.735399
1            department   81.406436
2        educationfield   46.126341
3            hourlyrate   75.506555
4         maritalstatus   40.226460
5         monthlyincome   29.141836
6              overtime   41.477950
7     performancerating   11.918951
8         standardhours   20.917759
9     totalworkingyears   32.717521
10      worklifebalance    6.793802
11  sameasmonthlyincome   29.141836
12               salary   16.984505
13      roledepartament   81.406436

In [10]:
def detectar_duplicados(df):
    numero_duplicados = df.duplicated().sum()
    print(f"Filas duplicadas completas en el dataset: {numero_duplicados}")
    if numero_duplicados > 0:
        print("Aquí tienes las filas duplicadas:")
        print(df[df.duplicated()])

In [11]:
detectar_duplicados(df)

Filas duplicadas completas en el dataset: 0

### Exploramos columna por columna

In [12]:
df.columns

Index(['Unnamed: 0', 'age', 'attrition', 'businesstravel', 'dailyrate',
       'department', 'distancefromhome', 'education', 'educationfield',
       'employeecount', 'employeenumber', 'environmentsatisfaction', 'gender',
       'hourlyrate', 'jobinvolvement', 'joblevel', 'jobrole',
       'jobsatisfaction', 'maritalstatus', 'monthlyincome', 'monthlyrate',
       'numcompaniesworked', 'overtime', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'standardhours',
       'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear',
       'worklifebalance', 'yearsatcompany', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'remotework'],
      dtype='object')

### 'age'

In [13]:
df['age'].value_counts()

age
35              88
31              88
34              86
29              82
36              79
32              66
30              65
38              64
33              63
40              60
28              54
37              54
27              54
45              50
42              50
41              48
39              46
26              46
43              42
46              38
44              34
50              34
47              30
24              29
25              28
49              26
55              25
51              22
48              22
53              20
54              20
52              18
56              18
21              17
22              17
58              16
23              15
59              11
20              11
18               9
19               9
57               6
60               5
thirty-two       2
twenty-four      2
thirty           1
fifty-eight      1
fifty-two        1
twenty-six       1
fifty-five       1
thirty-seven     1
thirty-six       1
forty-seven      1
thirty-one       1
Name: count, dtype: int64

In [14]:
# transformamos las edades escritas en palabras a números
words_to_numbers = {
    'eighteen': 18,
    'nineteen': 19,
    'twenty': 20,
    'twenty-one': 21,
    'twenty-two': 22,
    'twenty-three': 23,
    'twenty-four': 24,
    'twenty-five': 25,
    'twenty-six': 26,
    'twenty-seven': 27,
    'twenty-eight': 28,
    'twenty-nine': 29,
    'thirty': 30,
    'thirty-one': 31,
    'thirty-two': 32,
    'thirty-three': 33,
    'thirty-four': 34,
    'thirty-five': 35,
    'thirty-six': 36,
    'thirty-seven': 37,
    'forty-seven': 47,
    'fifty-two': 52,
    'fifty-five': 55,
    'fifty-eight': 58
}

In [15]:
# reemplazamos palabras por números, y convertimos la columna a tipo numérico
df['age'] = df['age'].replace(words_to_numbers)
df['age'] = pd.to_numeric(df['age'], errors='coerce')

print(df['age'].dtype)
print(df['age'].value_counts().sort_index())

int64
age
18     9
19     9
20    11
21    17
22    17
23    15
24    31
25    28
26    47
27    54
28    54
29    82
30    66
31    89
32    68
33    63
34    86
35    88
36    80
37    55
38    64
39    46
40    60
41    48
42    50
43    42
44    34
45    50
46    38
47    31
48    22
49    26
50    34
51    22
52    19
53    20
54    20
55    26
56    18
57     6
58    17
59    11
60     5
Name: count, dtype: int64

### 'attrition'

In [16]:
df['attrition'].value_counts()

attrition
No     1406
Yes     272
Name: count, dtype: int64

In [17]:
df['attrition'] = df['attrition'].str.lower()
print(df['attrition'].value_counts())

attrition
no     1406
yes     272
Name: count, dtype: int64

### 'businesstravel'

In [18]:
df['businesstravel'].value_counts()

businesstravel
travel_rarely        616
travel_frequently    168
non-travel            93
Name: count, dtype: int64

In [19]:
df['businesstravel'] = df['businesstravel'].str.replace(' ', '_', regex=False)
df['businesstravel'] = df['businesstravel'].str.replace('-', '_', regex=False).str.lower()
print(df['businesstravel'].value_counts())

businesstravel
travel_rarely        616
travel_frequently    168
non_travel            93
Name: count, dtype: int64

### 'dailyrate'

In [20]:
df['dailyrate'].value_counts()

dailyrate
556.256661     326
290.035510     308
1032.487286    150
1582.771346     55
1973.984127     38
              ...
320.047619       1
470.063492       1
436.428571       1
501.325397       1
2004.785714      1
Name: count, Length: 673, dtype: int64

In [21]:
# reducimos a dos decimales los valores de la columna 'dailyrate'
df['dailyrate'] = df['dailyrate'].round(2)
print(df['dailyrate'].value_counts())

dailyrate
556.26     326
290.04     308
1032.49    150
1582.77     55
1973.98     38
          ...
320.05       1
470.06       1
436.43       1
501.33       1
2004.79      1
Name: count, Length: 673, dtype: int64

### 'department'

In [22]:
df['department'].value_counts()

department
Research & Development     203
Sales                       93
Human Resources             16
Name: count, dtype: int64

In [23]:
df['department'].unique()

array([nan, ' Research & Development ', ' Sales ', ' Human Resources '],
      dtype=object)

In [24]:
df['department'] = df['department'].apply(
    lambda x: x.strip().replace(' ', '_').lower() if pd.notna(x) else x
)

print(df['department'].value_counts())

department
research_&_development    203
sales                      93
human_resources            16
Name: count, dtype: int64

In [25]:
df['department'].isnull().sum()

1366

In [26]:
df['department'].unique()

array([nan, 'research_&_development', 'sales', 'human_resources'],
      dtype=object)

### 'distancefromhome'

In [27]:
df['distancefromhome'].value_counts()

distancefromhome
 2     228
 1     209
 9      89
 10     86
 8      85
      ...
-21      2
-34      2
-43      2
-39      1
-40      1
Name: count, Length: 69, dtype: int64

In [28]:
# pasamos la distancia a positivos, ya que hay valores negativos
df['distancefromhome'] = df['distancefromhome'].abs()
print(df['distancefromhome'].value_counts())

distancefromhome
2     228
1     209
10     92
9      89
8      85
7      82
3      79
5      65
4      64
6      63
24     37
16     37
12     33
13     33
11     33
18     32
15     31
25     31
26     30
29     30
23     30
14     28
19     23
20     23
17     22
21     22
22     21
28     20
27     18
47      8
35      8
38      7
31      6
36      6
42      6
45      6
48      5
37      5
46      5
32      4
41      4
30      4
33      3
44      3
34      2
49      2
43      2
39      1
40      1
Name: count, dtype: int64

### 'education'

In [29]:
df['education'].value_counts()

education
3    649
4    461
2    322
1    186
5     60
Name: count, dtype: int64

### 'educationfield'

In [30]:
df['educationfield'].value_counts()

educationfield
Life Sciences       367
Medical             286
Marketing           106
Technical Degree     70
Other                63
Human Resources      12
Name: count, dtype: int64

In [31]:
df['educationfield'] = (
    df['educationfield']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['educationfield'].value_counts())

educationfield
nan                 774
life_sciences       367
medical             286
marketing           106
technical_degree     70
other                63
human_resources      12
Name: count, dtype: int64

### 'employeecount'

In [32]:
df['employeecount'].value_counts()

employeecount
1    1678
Name: count, dtype: int64

In [33]:
# no aporta información útil, la eliminamos
df = df.drop(columns='employeecount')

### 'employeenumber'

In [ ]:
df['employeenumber'].value_counts()

In [ ]:
df[df.duplicated(subset='employeenumber', keep=False)].sort_values('employeenumber')

In [ ]:
df = df.drop_duplicates()

In [ ]:
df['employeenumber'].is_unique

In [ ]:
df[df.duplicated(subset='employeenumber', keep=False)].sort_values('employeenumber')
#obs . age = más de 100 borrarlos o emparejarlos con la edad menor de la base 
# y luego buscar los duplicados
#age=unnamed

In [ ]:
print(f"Número de employeenumber duplicados: {df.duplicated(subset='employeenumber').sum()}")

### 'environmentsatisfaction'

In [ ]:
df['environmentsatisfaction'].value_counts()

In [ ]:
# detectamos valores no válidos, deberían ser del 1 al 4

df['environmentsatisfaction'] = df['environmentsatisfaction'].apply(
    lambda x: np.nan if x>4 else x
)

print(df['environmentsatisfaction'].value_counts())
# puede ser que acá esté el problema - cambiamos los que no están en el rango por nan, 
# no los sacamos de la muestra

In [ ]:
df['department'].isnull().sum()

In [ ]:
# sustituimos los valores numéricos por texto para una mejor comprensión
satisfaction_map = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}

df['environmentsatisfaction'] = df['environmentsatisfaction'].replace(satisfaction_map)
print(df['environmentsatisfaction'].value_counts())

In [ ]:
df['environmentsatisfaction'] = (
    df['environmentsatisfaction']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['environmentsatisfaction'].value_counts())

### 'gender'

In [ ]:
df['gender'].value_counts()

In [ ]:
# típicamente, 0 es femenino y 1 es masculino. Aún así, comprobamos con la media de dailyrate, que suele ser más alta en hombres que en mujeres
df.groupby('gender')['dailyrate'].mean()

In [ ]:
gender_map = {
    0: 'Female',
    1: 'Male'
}

df['gender'] = df['gender'].replace(gender_map)
df['gender'].value_counts()

In [ ]:
df['gender'] = df['gender'].astype(str).str.lower()
print(df['gender'].value_counts())

### 'hourlyrate'

In [ ]:
df['hourlyrate'].value_counts()

In [ ]:
df['hourlyrate'] = df['hourlyrate'].round(2)

### 'jobinvolvement'

In [ ]:
df['jobinvolvement'].value_counts()

In [ ]:
# sustituimos los valores numéricos por texto para una mejor comprensión
jobinvolvement_map = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}

df['jobinvolvement'] = df['jobinvolvement'].replace(jobinvolvement_map)
print(df['jobinvolvement'].value_counts())

In [ ]:
df['jobinvolvement'] = (
    df['jobinvolvement']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['jobinvolvement'].value_counts())

### 'joblevel'

In [ ]:
df['joblevel'].value_counts()

In [ ]:
# comprobamos la media de dailyrate por joblevel, para establecer una relación entre el nivel de trabajo y la remuneración
df.groupby('joblevel')['dailyrate'].mean()

In [ ]:
joblevel_map = {
    1: 'Entry Level',
    2: 'Intermediate',
    3: 'Senior',
    4: 'Manager',
    5: 'Executive'
}
df['joblevel'] = df['joblevel'].replace(joblevel_map)
print(df['joblevel'].value_counts())

In [ ]:
df['joblevel'] = (
    df['joblevel']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['joblevel'].value_counts())

### 'jobrole'

In [ ]:
df['jobrole'].value_counts()

In [ ]:
df['jobrole'] = df['jobrole'].str.strip().str.lower().str.title()
df['jobrole'].value_counts()

In [ ]:
df['jobrole'] = (
    df['jobrole']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['jobrole'].value_counts())

### 'jobsatisfaction'

In [ ]:
df['jobsatisfaction'].value_counts()

In [ ]:
satisfaction_map = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}

df['jobsatisfaction'] = df['jobsatisfaction'].replace(satisfaction_map)
print(df['jobsatisfaction'].value_counts())

In [ ]:
df['jobsatisfaction'] = (
    df['jobsatisfaction']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['jobsatisfaction'].value_counts())

### 'maritalstatus'

In [ ]:
df['maritalstatus'].value_counts()

In [ ]:
df['maritalstatus'] = df['maritalstatus'].str.strip().str.lower()
print(df['maritalstatus'].value_counts())

### 'monthlyincome'

In [ ]:
df['monthlyincome'].value_counts()

In [ ]:
# transformamos la columna 'monthlyincome' para que sea numérica, eliminando el símbolo de dólar y la coma
df['monthlyincome'] = df['monthlyincome'].str.replace('$', '', regex=False)
df['monthlyincome'] = df['monthlyincome'].str.replace(',', '.', regex=False)
df['monthlyincome'] = pd.to_numeric(df['monthlyincome'], errors='coerce')

In [ ]:
print(df['monthlyincome'].dtype)
df['monthlyincome'].describe()
df['monthlyincome'].value_counts()

### 'monthlyrate'

In [ ]:
df['monthlyrate'].value_counts()

In [ ]:
# pasamos a str para corregir símbolos y puntos, luego convertimos a numérico
df['monthlyrate'] = df['monthlyrate'].astype(str)
df['monthlyrate'] = df['monthlyrate'].str.replace('$', '', regex=False)
df['monthlyrate'] = df['monthlyrate'].str.replace(',', '.', regex=False)
df['monthlyrate'] = pd.to_numeric(df['monthlyrate'], errors='coerce')
print(df['monthlyrate'].dtype)

In [ ]:
df['monthlyrate'].value_counts()

### 'numcompaniesworked'

In [ ]:
df['numcompaniesworked'].value_counts()

### 'overtime'

In [ ]:
df['overtime'].value_counts()

In [ ]:
df['overtime'] = df['overtime'].str.strip().str.lower()
print(df['overtime'].value_counts())

### 'percentsalaryhike'

In [ ]:
# porcentaje de aumento salarial
df['percentsalaryhike'].value_counts()

### 'performancerating'

In [ ]:
df['performancerating'].value_counts()

In [ ]:
# puede servir para descartar una hipótesis, por ejemplo: "¿El desempeño influye en que una persona se vaya o esté satisfecha?”

### 'standardhours'

In [ ]:
df['standardhours'].value_counts()

In [ ]:
df['standardhours'] = (
    df['standardhours']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['standardhours'].value_counts())

### 'relationshipsatisfaction'

In [ ]:
rel_map = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}
df['relationshipsatisfaction'] = df['relationshipsatisfaction'].replace(rel_map)
print(df['relationshipsatisfaction'].value_counts())

In [ ]:
df['relationshipsatisfaction'] = (
    df['relationshipsatisfaction']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['relationshipsatisfaction'].value_counts())

### 'stockoptionlevel'

In [ ]:
df[ 'stockoptionlevel'].value_counts()

In [ ]:
# Esta variable indica el nivel de opciones sobre acciones que tiene asignadas cada persona. Es decir, si reciben parte de su compensación en acciones de la empresa. Los niveles más altos suelen asignarse a empleados de mayor nivel o con mejor rendimiento.
# 0: No stock options / 1-3: Diferentes niveles de acciones asignadas

### 'totalworkingyears'

In [ ]:
df['totalworkingyears'].value_counts()

In [ ]:
df['totalworkingyears'].isna().sum()

In [ ]:
df['totalworkingyears'] = (
    df['totalworkingyears']
    .astype(str)
    .replace('<NA>', np.nan)                   
    .str.replace(',', '.', regex=False)        
    .astype(float)
    .astype('Int64')                           
)
print(df['totalworkingyears'].dtype)
print(df['totalworkingyears'].value_counts())

### 'trainingtimeslastyear'

In [ ]:
df['trainingtimeslastyear'].value_counts()

### 'worklifebalance'

In [ ]:
df['worklifebalance'].value_counts()

In [ ]:
df['worklifebalance'].isna().sum()

In [ ]:
df['worklifebalance'] = df['worklifebalance'].str.replace(',', '.').astype(float)

df['worklifebalance'] = df['worklifebalance'].replace({
    1.0: 'very_low',
    2.0: 'low',
    3.0: 'good',
    4.0: 'excellent'
})
print(df['worklifebalance'].value_counts())

### 'yearsatcompany'

In [ ]:
df['yearsatcompany'].value_counts()

### 'yearssincelastpromotion'

In [ ]:
df['yearssincelastpromotion'].value_counts()

### 'yearswithcurrmanager'

In [ ]:
df['yearswithcurrmanager'].value_counts()

### 'sameasmonthlyincome'

In [ ]:
df['sameasmonthlyincome'].value_counts()

In [ ]:
# eliminamos porque es una copia de 'monthlyincome'
df.drop(columns='sameasmonthlyincome', inplace=True)

### 'datebirth'

In [ ]:
df['datebirth'].value_counts()

In [ ]:
df['datebirth'].describe()

### 'salary'

In [ ]:
df['salary'].value_counts()

In [ ]:
# nos aseguramos de que sea tipo texto
df['salary'] = df['salary'].astype(str)

# eliminamos el símbolo $ y reemplazamos la coma por punto
df['salary'] = df['salary'].str.replace('$', '', regex=False)
df['salary'] = df['salary'].str.replace(',', '.', regex=False)

# convertimos a número decimal (float)
df['salary'] = pd.to_numeric(df['salary'], errors='coerce')
print(df['salary'].dtype)
print(df['salary'].value_counts())

### 'roledepartament'

In [ ]:
df['roledepartament'].value_counts()

In [ ]:
# ya tenemos las columnas 'jobrole' y 'department', así que eliminamos esta columna, que tiene un alto porcentaje de nulos
# df.drop(columns='roledepartament', inplace=True)

### 'remotework'

In [ ]:
df['remotework'].value_counts()

In [ ]:
# Convertimos todo a string para estandarizar
df['remotework'] = df['remotework'].astype(str).str.strip().str.lower()

# Reemplazamos todas las variantes por 'yes' o 'no'
df['remotework'] = df['remotework'].replace({
    '1': 'yes',
    'true': 'yes',
    'yes': 'yes',
    '0': 'no',
    'false': 'no'
})
print(df['remotework'].value_counts())

In [ ]:
df = df.drop(columns=['Unnamed: 0'])

In [ ]:
df.columns

In [ ]:
df = df.rename(columns={'businesstravel': 'business_travel', 
                        'dailyrate': 'daily_rate',
                        'distancefromhome': 'distance_from_home', 
                        'educationfield': 'education_field',
                        'employeecount': 'employee_count',
                        'employeenumber': 'employee_number',
                        'environmentsatisfaction': 'environment_satisfaction',
                        'hourlyrate': 'hourly_rate',
                        'jobinvolvement': 'job_involvement',
                        'joblevel': 'job_level',
                        'jobrole': 'job_role',
                        'jobsatisfaction': 'job_satisfaction',
                        'maritalstatus': 'marital_status',
                        'monthlyincome': 'monthly_income',
                        'monthlyrate': 'monthly_rate',
                        'numcompaniesworked': 'num_companies_worked',
                        'percentsalaryhike': 'percent_salary_hike',
                        'performancerating': 'performance_rating',
                        'relationshipsatisfaction': 'relationship_satisfaction',
                        'standardhours': 'standard_hours',
                        'stockoptionlevel': 'stock_option_level',
                        'totalworkingyears': 'total_working_years',
                        'trainingtimeslastyear': 'training_times_last_year',
                        'worklifebalance': 'work_life_balance',
                        'yearsatcompany': 'years_at_company',
                        'yearsincurrentrole': 'yearsincurrentrole',
                        'yearssincelastpromotion': 'years_since_last_promotion',
                        'yearswithcurrmanager': 'years_with_curr_manager',
                        'datebirth': 'date_birth', 
                        'roledepartament': 'role_departament',
                        'remotework': 'remote_work'})

In [ ]:
df.columns

In [ ]:
nulls(df,1,1)

In [ ]:
df['department'].unique()

In [ ]:
df.columns